app/views/photos/showbylocation.html.erb

          <% photos = @photos.where(:location_id => @loc) %>
       <%= photos.first.location.city_country %>
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 2]]