app/controllers/hiking_trails_controller.rb

  def index
    @hiking_trails = HikingTrail.all
---
SELECT "hiking_trails".* FROM "hiking_trails"

  def show
    @hiking_trail = HikingTrail.find(params[:id])
---
SELECT  "hiking_trails".* FROM "hiking_trails" WHERE "hiking_trails"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @hiking_trail = HikingTrail.new
    @hiking_trail.link = params[:link]
    @hiking_trail.our_rating = params[:our_rating]
    @hiking_trail.our_review = params[:our_review]
    @hiking_trail.location_id = params[:location_id]
    @hiking_trail.description = params[:description]
    @hiking_trail.image = params[:image]

    if @hiking_trail.save
---
INSERT INTO "hiking_trails" ("link", "our_rating", "our_review", "location_id", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @hiking_trail = HikingTrail.find(params[:id])
---
SELECT  "hiking_trails".* FROM "hiking_trails" WHERE "hiking_trails"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @hiking_trail = HikingTrail.find(params[:id])

    @hiking_trail.link = params[:link]
    @hiking_trail.our_rating = params[:our_rating]
    @hiking_trail.our_review = params[:our_review]
    @hiking_trail.location_id = params[:location_id]
    @hiking_trail.description = params[:description]
    @hiking_trail.image = params[:image]

    if @hiking_trail.save
---
SELECT  "hiking_trails".* FROM "hiking_trails" WHERE "hiking_trails"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "hiking_trails" SET "our_review" = ?, "description" = ?, "updated_at" = ? WHERE "hiking_trails"."id" = ?  [["our_review", "Awesome trail with steam everywhere and natural bathing pools"], ["description", "Reykjadalur (Steam Valley)"], ["updated_at", "2015-12-07 23:06:39.537572"], ["id", 1]]