app/controllers/hotels_controller.rb

SELECT "hotels".* FROM "hotels"
---
  def index
    @hotels = Hotel.all

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @hotel = Hotel.find(params[:id])

INSERT INTO "hotels" ("description", "link", "our_rating", "our_review", "location_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hotel = Hotel.new
    @hotel.description = params[:description]
    @hotel.link = params[:link]
    @hotel.our_rating = params[:our_rating]
    @hotel.our_review = params[:our_review]
    @hotel.location_id = params[:location_id]
    @hotel.image = params[:image]

    if @hotel.save

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @hotel = Hotel.find(params[:id])

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "hotels" SET "description" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["description", "Cozy cottages in Bragdavellir"], ["updated_at", "2015-12-07 23:14:32.289718"], ["id", 1]]
---
  def update
    @hotel = Hotel.find(params[:id])

    @hotel.description = params[:description]
    @hotel.link = params[:link]
    @hotel.our_rating = params[:our_rating]
    @hotel.our_review = params[:our_review]
    @hotel.location_id = params[:location_id]
    @hotel.image = params[:image]

    if @hotel.save