app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]

  def showbyprice
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

    def showbyrating
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

    def showbycategory
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    @location = Location.new
    @location.category = params[:category]
    @location.our_review = params[:our_review]
    @location.destination_summary = params[:destination_summary]
    @location.our_rating = params[:our_rating]
    @location.price = params[:price]
    @location.city_country = params[:city_country]
    @location.date = params[:date]
    @location.image = params[:image]

    if @location.save
---
INSERT INTO "locations" ("category", "our_review", "destination_summary", "our_rating", "price", "city_country", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @location = Location.find(params[:id])

    @location.category = params[:category]
    @location.our_review = params[:our_review]
    @location.destination_summary = params[:destination_summary]
    @location.our_rating = params[:our_rating]
    @location.price = params[:price]
    @location.city_country = params[:city_country]
    @location.date = params[:date]
    @location.image = params[:image]

    if @location.save
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "locations" SET "destination_summary" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["destination_summary", "An island where magic just might exist..."], ["updated_at", "2015-12-07 23:10:39.081951"], ["id", 1]]