app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 2]]

  def showbylocation
    @photos = Photo.all
---
SELECT  "photos".* FROM "photos"  ORDER BY "photos"."id" ASC LIMIT 1

  def create
    @photo = Photo.new
    @photo.location_id = params[:location_id]
    @photo.image_url = params[:image_url]

    if @photo.save
---
INSERT INTO "photos" ("location_id", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location_id", 2], ["image_url", "http://www.takeourphotograph.com/img/s2/v58/p1587307571-3.jpg"], ["created_at", "2015-12-07 20:02:36.800665"], ["updated_at", "2015-12-07 20:02:36.800665"]]