app/views/locations/_location_panel_overview.erb

SELECT "hiking_trails"."link" FROM "hiking_trails" WHERE "hiking_trails"."location_id" = ?  [["location_id", 1]]
---
     <% trails = [] %>
     <% trails = @location.hiking_trails.pluck(:link) %>

SELECT "hotels"."link" FROM "hotels" WHERE "hotels"."location_id" = ?  [["location_id", 1]]
---
     <% hotels = [] %>
     <% hotels = @location.hotels.pluck(:link) %>